'''
random.random()
случайный элемент от 0 до 1.0(число с плавающей точкой)

random.uniform(a,b)
возвращает случайное число между a и b

random.randint(1,100)
случайное целое число от 1 до 100



random.choice(sequence)
выбирает случайный элемент из последовательности(множества и словари не очень дружат с этим вариантом)

random.choises(population, weights =None, k=1)
выбирает k элементов с возможностью повторения. Можно задать частоту определенного числа

random.sample(population, k)
выбирает k случайных элементов(без повторений)

random.shuffle(sequence)
перемешивает список(перемешивает оригинал)

'''