'''
print("Hello")
print("Aidan")
print(5 + 5)
print(5 - 10)
print(5 * 5)
print(10 / 3)
print((2 + 2) * 2 + 4)
print (20 ** 3) возведение в степень
print(10%4) остаток от деления
print(10 // 6) деление без остатка

print("Результат деления 10/2", 10/2, "программа закончила работу")

lenghtOfSide = 7
print(lenghtOfSide ** 2)

km = 5
mile = 1.6
print(km / mile)

a = 5
b = 7
print(a * b)

sep = ":)" sep предназначен чтобы установить символ вместо пробела(по дефолту стоит пробел)
end = ":(" end отвечает за переход на следующую строчку, а именно за изменение
переноса строки на символ(по дефолту перенос сторки)

'''
print(4,5,6, end = ":(")
