'''
O - сложность 
O(1) - постоянная сложность
взятие элемента по индексу

O(log n) - логарифмическая сложность
каждый шаг уменьшает 

Загадано: 73
1. Больше 50? Да. Остался диапазон 51-100
2. Больше 75? Нет. Остался диапазон 51 - 75
3.

O(n) - линейная сложность
время растет с количеством данных прямо пропорционально

O(n log n) - логарифмически-линейная сложность
каждый шаг уменьшает поиск до самых мелких возможных вариантов и просто их считает.

O(n^2)
время растет как квадрат от кол-ва данных 

O(2^n)
ОЧЕНЬ неэкономное использование ресурсов компьютера

O(n)
for i in range(n)

O(n) * O(n) = O(n^2)
for i in range(n):
    for j in range(n):
 

'''